Repository: Rouhis/EVChargeGX
Catalog: EVChargeGX/Localization/*.lproj/Localizable.strings
Languages: fi

source: Search
fi: Etsi

source: Profile
fi: Profiili

source: Selected car:
fi: Valittu auto:

source: Manufacturer:
fi: Valmistaja:

source: Model:
fi: Malli:

source: Battery capacity(kWh):
fi: Akun kapasiteetti:

source: Owned connectors
fi: Omistetut liitännät

source: Manufacturer
fi: Valmistaja

source: Model
fi: Malli

source: Battery capacity(kWh)
fi: Akun kapasiteetti

source: You can skip this part, but vehicle information won't be saved
fi: Voi ohittaa tämän, mutta mitään dataa ajoneuvostasi ei talleneta

source: Welcome!
fi: Tervetuloa

source: Vehicle information
fi: Ajoneuvon tiedot

source: Please give us information about your electric vehicle
fi: Täytä tiedot sinun sähköajoneuvostasi

source: Preferred/Owned connector types
fi: Ensisijaiset/omistetut liitintyypit

source: Done
fi: Valmis

source: I will do this later
fi: Teen tämän myöhemmin

source: Model:
fi: Malli:

source: Your owned connector input is used to filter out stations with connectors you don't own.
fi: Sinulle näytetään asemia omistamiesi liittimien mukaan

source: Add a new car
fi: Lisää auto

source: Cancel
fi: Peruuta

source: Save
fi: Tallenna

source: No cars
fi: Ei autoja

source: Our app uses your location to give you information about charging stations near you
fi: Applikaatio käyttää sijaintiasi näyttääkseen latausasemia lähelläsi
